v2/app/controllers/beneficios_controller.rb

SELECT "beneficios".* FROM "beneficios"
---
  def index
    @beneficios = Beneficio.all

INSERT INTO "beneficios" ("nomBeneficio", "imgBeneficio", "puntBeneficio", "porcDescuento", "inFavorito", "idFavorito", "idEje", "nomEje", "iconEje", "iconSEje", "idLocal", "inAbierto", "numLongitud", "numLatitud", "numDistancia", "nomDistrito", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @beneficio = Beneficio.new(beneficio_params)

    respond_to do |format|
      if @beneficio.save

UPDATE "beneficios" SET "iconEje" = ?, "updated_at" = ? WHERE "beneficios"."id" = ?  [["iconEje", "https://cdn0.iconfinder.com/data/icons/transportation-icons-3/110/Car-Oil-2-512.png"], ["updated_at", "2018-07-15 05:33:26.141183"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @beneficio.update(beneficio_params)

DELETE FROM "beneficios" WHERE "beneficios"."id" = ?  [["id", 1]]
---
  def destroy
    @beneficio.destroy

SELECT  "beneficios".* FROM "beneficios" WHERE "beneficios"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_beneficio
      @beneficio = Beneficio.find(params[:id])