v2/app/controllers/ejes_controller.rb

  def index
    @ejes = Eje.all
---
SELECT "ejes".* FROM "ejes"

  def create
    @eje = Eje.new(eje_params)

    respond_to do |format|
      if @eje.save
---
INSERT INTO "ejes" ("nomEje", "imgEje", "iconEje", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @eje.update(eje_params)
---
UPDATE "ejes" SET "imgEje" = ?, "iconEje" = ?, "updated_at" = ? WHERE "ejes"."id" = ?  [["imgEje", "https://image.flaticon.com/icons/png/512/91/91685.png"], ["iconEje", "https://image.flaticon.com/icons/png/512/91/91685.png"], ["updated_at", "2018-07-15 05:10:50.986088"], ["id", 4]]

    def set_eje
      @eje = Eje.find(params[:id])
---
SELECT  "ejes".* FROM "ejes" WHERE "ejes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]