v2/app/controllers/empresas_controller.rb

SELECT "empresas".* FROM "empresas"
---
  def index
    @empresas = Empresa.all

INSERT INTO "empresas" ("nomEmpresa", "desEmpresa", "urlLogo", "numSoporte", "nomSkype", "inClave", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @empresa = Empresa.new(empresa_params)

    respond_to do |format|
      if @empresa.save

SELECT  "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_empresa
      @empresa = Empresa.find(params[:id])