v2/app/controllers/servicios_controller.rb

SELECT "servicios".* FROM "servicios"
---
  def index
    @servicios = Servicio.all

INSERT INTO "servicios" ("nomServicio", "inActivo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nomServicio", "Cambio de Aceite"], ["inActivo", "Activo"], ["created_at", "2018-07-15 05:32:29.090849"], ["updated_at", "2018-07-15 05:32:29.090849"]]
---
  def create
    @servicio = Servicio.new(servicio_params)

    respond_to do |format|
      if @servicio.save

SELECT  "servicios".* FROM "servicios" WHERE "servicios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_servicio
      @servicio = Servicio.find(params[:id])