app/controllers/api/v1/beneficios_controller.rb

    def index
        beneficios = Beneficio.order("created_at DESC")
---
SELECT "beneficios".* FROM "beneficios" ORDER BY created_at DESC

    def show
        beneficio = Beneficio.find(params[:id])
---
SELECT  "beneficios".* FROM "beneficios" WHERE "beneficios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]