app/controllers/api/v1/ejes_controller.rb

SELECT "ejes".* FROM "ejes" ORDER BY created_at DESC
---
    def index
        ejes = Eje.order("created_at DESC")