app/controllers/api/v1/proveedors_controller.rb

SELECT `proveedors`.* FROM `proveedors` ORDER BY created_at DESC
---
    def index
		proveedors = Proveedor.order("created_at DESC")