app/controllers/api/v1/usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios" ORDER BY created_at DESC
---
    def index
        usuarios = Usuario.order("created_at DESC")

INSERT INTO "usuarios" ("nomUsuario", "created_at", "updated_at") VALUES (?, ?, ?)  [["nomUsuario", "avermes"], ["created_at", "2018-07-15 06:02:21.554880"], ["updated_at", "2018-07-15 06:02:21.554880"]]
---
    def create
        usuario = Usuario.new(usuario_params)

        if usuario.save