v2/app/views/dashboard/estadisticas.html.erb

SELECT "proveedors".* FROM "proveedors" WHERE "proveedors"."user_id" = ? AND (created_at IS NOT NULL) GROUP BY strftime('%Y-%m-%d 00:00:00 UTC', created_at)  [["user_id", 1]]
SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d 00:00:00 UTC', created_at) AS strftime_y_m_d_00_00_00_utc_created_at FROM "proveedors" WHERE "proveedors"."user_id" = ? AND (created_at IS NOT NULL) GROUP BY strftime('%Y-%m-%d 00:00:00 UTC', created_at)  [["user_id", 1]]
---
            <h5>Cantidad de proveedores creados</h5>
            <%= column_chart current_user.proveedors.group_by_day(:created_at).count %>