app/controllers/imagens_controller.rb

SELECT "imagens".* FROM "imagens"
---
  def index
    @imagens = Imagen.all

INSERT INTO "imagens" ("urlImagen", "urlImagenPrevia", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @imagen = Imagen.new(imagen_params)

    respond_to do |format|
      if @imagen.save

SELECT  "imagens".* FROM "imagens" WHERE "imagens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_imagen
      @imagen = Imagen.find(params[:id])