app/controllers/locals_controller.rb

SELECT "locals".* FROM "locals"
---
  def index
    @locals = Local.all

INSERT INTO "locals" ("nomLocal", "numLatitud", "numLongitud", "dirLocal", "nomDistrito", "numTelefono", "inAbierto", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @local = Local.new(local_params)

    respond_to do |format|
      if @local.save

SELECT  "locals".* FROM "locals" WHERE "locals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_local
      @local = Local.find(params[:id])