app/controllers/proveedors_controller.rb

SELECT `proveedors`.* FROM `proveedors`
---
  def index
    @proveedors = Proveedor.all

INSERT INTO `proveedors` (`razon_social`, `direccion`, `distrito`, `provincia`, `departamento`, `telefono`, `celular1`, `celular2`, `correo`, `tipo_servicio`, `latitud`, `longitud`, `url`, `hora_inicio`, `hora_fin`, `foto_local`, `created_at`, `updated_at`) VALUES ('123456789', 'Av. A145', 'Lince', 'Lima', 'Lima', '86135699', '3215466123', '1234564679', 'proveedor1@gmail.com', 'Grifo', '-12.059612966342069', '-77.04405605793', 'wwww.proveedor1.com', '07:00 AM', '5:00 PM', '', '2018-06-26 02:05:07', '2018-06-26 02:05:07')
---
  def create
    @proveedor = current_user.proveedors.build(proveedor_params)

    respond_to do |format|
      if @proveedor.save

UPDATE `proveedors` SET `correo` = 'proveedor2@gmail.com', `updated_at` = '2018-06-26 02:16:26' WHERE `proveedors`.`id` = 3
---
  def update
    respond_to do |format|
      if @proveedor.update(proveedor_params)

DELETE FROM "proveedors" WHERE "proveedors"."id" = ?  [["id", 2]]
---
  def destroy
    @proveedor.destroy

SELECT  "proveedors".* FROM "proveedors" WHERE "proveedors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_proveedor
      @proveedor = Proveedor.find(params[:id])