app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("logiUsuario", "nomUsuario", "correoUsuario", "apeUsuario", "numDni", "numCelular", "imgUsuario", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save