v2/app/controllers/api/v1/empresas_controller.rb

    def index
        empresas = Empresa.order("created_at DESC")
---
SELECT "empresas".* FROM "empresas" ORDER BY created_at DESC